app/Controllers/Cbus.php

SELECT *
FROM `comercios`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `cbus`
WHERE `id` = '1'
 LIMIT 1
---
    public function editar_cbu($comercio_id = 0,$cbu_id = 0){
        $comercio = (new ComerciosModel())->where('id', $comercio_id)->first();

        $cbu = (new CbusModel())->where('id',$cbu_id)->first();

SELECT *
FROM `cbus`
WHERE `id` = 0
 LIMIT 1
INSERT INTO `cbus` (`alias`, `cbu`, `comercios_id`) VALUES ('diamante.oro', '12321234354365', '6')
---
    public function save_cbu(){
        $cbu_id = $this->request->getVar('cbu_id') ? : 0;
        $comercio_id = $this->request->getVar('comercio_id') ? : 0;
        $alias = $this->request->getVar('alias');
        $cbu = $this->request->getVar('cbu');

        $datos = [
            'alias' => $alias,
            'cbu' => $cbu,
            'comercios_id' => $comercio_id
        ];

        $CBU = (new CbusModel())->where('id',$cbu_id)->first();

        if(!empty($CBU)){
            (new CbusModel())->update($cbu_id,$datos);
            $message = "SE EDITO";
        }else{
            (new CbusModel())->insert($datos);

SELECT *
FROM `cbus`
WHERE `id` = '13'
 LIMIT 1
DELETE FROM `cbus`
WHERE `id` IN ('13')
---
    public function borrar_cbu($cbu_id = 0){
        $cbu = (new CbusModel())->where('id',$cbu_id)->first();

        if(!empty($cbu)){
            (new CbusModel())->delete($cbu_id);

SELECT *
FROM `cbus`
WHERE `comercios_id` = '1'
---
    public function actualizar_listado_cbu($comercio_id = 0){
        $cbus = (new CbusModel())->where('comercios_id', $comercio_id)->get()->getResultArray();