app/Controllers/Comercios.php

SELECT *
FROM `comercios`
WHERE `user_id` = '1'
---
    public function listado_comercio(){
        $comercios = (new ComerciosModel())->where('user_id', session()->get('user.id'))->get()->getResultArray();

SELECT *
FROM `comercios`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `cbus`
WHERE `comercios_id` = '1'
---
    public function editar_comercio($comercio_id = 0){
        $comercio = (new ComerciosModel())->where('id', $comercio_id)->first();
        $cbus = (new CbusModel())->where('comercios_id', $comercio_id)->get()->getResultArray();

SELECT *
FROM `comercios`
WHERE `id` = 0
 LIMIT 1
INSERT INTO `comercios` (`user_id`, `cuit`, `razon_social`) VALUES ('1', '23418738529', 'Lospibes')
---
    public function save_comercio(){
        $id = $this->request->getVar('id') ? : 0;
        $cuit = $this->request->getVar('cuit');
        $razon_social = $this->request->getVar('razon_social');

        $comercio = (new ComerciosModel())->where('id', $id)->first();

        $datos = [
            'cuit' => $cuit,
            'razon_social' => $razon_social
        ];

        if(!empty($comercio)){
            (new ComerciosModel())->update($id,$datos);

            $message = "SE ACTUALIZO LOS DATOS";
        }else{
            (new ComerciosModel())->set('user_id',session()->get('user.id'))->set($datos)->insert();

SELECT *
FROM `comercios`
WHERE `id` = '2'
 LIMIT 1
DELETE FROM `comercios`
WHERE `id` IN ('2')
DELETE FROM `cbus`
WHERE `comercios_id` = '2'
---
    public function borrar_comercio($comercio_id = 0){
        $comercio = (new ComerciosModel())->where('id',$comercio_id)->first();

        if(!empty($comercio)){
            (new ComerciosModel())->delete($comercio_id);
            (new CbusModel())->where('comercios_id',$comercio_id)->delete();

SELECT *
FROM `comercios`
WHERE `user_id` = '1'
---
    public function actualizar_listado_comercio(){
        $comercios = (new ComerciosModel())->where('user_id', session()->get('user.id'))->get()->getResultArray();