app/Controllers/Usuarios.php

SELECT *
FROM `users`
WHERE `email` = 'pruebafactura@gmail.com'
AND `password` = '123'
 LIMIT 1
---
    public function validar_usuario()
    {
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $usuario = (new UsersModel())->where('email', $email)->where('password', $password)->first();